[
    {
        "id": 0,
        "description": "Absolutely love this sheet set. There are a lot of sheet sets that claim to be soft but are disappointingly not. Fortunately, these sheets are exactly what they claim and are super soft. I would definitely buy these again.",
        "rating": 5
    },
    {
        "id": 1,
        "description": "First, it was missing the pillow case. Next, they’re crazy thin. Very cheap. Soft but cheap.",
        "rating": 2
    },
    {
        "id": 2,
        "description": "Although the fabric is soft, and okay to the feel, it’s not all that great a product. The stitching is awful. After 2 washings, the seams are coming apart on the fitted sheet. When folding the sheets I noticed that the fabric has become lopped sided, so it doesn’t fold and store nicely. Even the flat sheet and pillow cases.",
        "rating": 2
    },
    {
        "id": 3,
        "description": "Married into a family so I now have 2 granddaughters ages 2 and 5. I went out and bought comforters and wanted sheets to match. These are perfect. The quality is nice wasn't peeled yet.",
        "rating": 5
    },
    {
        "id": 4,
        "description": "Would give 5/5 but just waiting to see how they hold up over time. So far, they look great and are super soft to the touch. Definitely a good, economic choice for soft sheets",
        "rating": 5
    },
    {
        "id": 5,
        "description": "Coconut milk color was a pale yellow instead, they are incredibly thin, and not the same brand as original labeled when purchased. The reviews gave me high hopes but these are overall sad. Even worse I bought several for my rental",
        "rating": 1
    },
    {
        "id": 6,
        "description": "Pretty pink color, extremely soft to the touch.\nI even like the elastic they way it's made. Bought another\nsheet set and it had one continuous elastic that if it broke\nin one place the whole thing would not have an elastic in it.\nHowever they are a bit thin.",
        "rating": 5
    },
    {
        "id": 7,
        "description": "We purchased the sheets for our guest room. Our guests said they had the best night’s sleep. They commented that the sheets were soft, cool and they loved them. Would buy again.",
        "rating": 5
    },
    {
        "id": 8,
        "description": "Poor quality. Pillow case arrived torn at the seams.",
        "rating": 1
    },
    {
        "id": 9,
        "description": "If you get the color \"coconut milk\" like I did, it does not look like the picture which is more of a cream color. These have a gross yellowish tinge to it that is completely unusable in my color scheme and past the return window. I've never had a problem with their colors being so off before and the sheet set didn't say Cathay on them but some other brand. So pay attention quickly so you can return them if the color is off.",
        "rating": 5
    },
    {
        "id": 10,
        "description": "I was missing my pillow cases",
        "rating": 2
    },
    {
        "id": 11,
        "description": "I bought this as a wedding gift for one of my staff. She loves to prepare meals so I thought this would be a good idea for her. She can't stop talking about it. I got the stand to go with it which I think is a must buy. It came in the mail and it was well packaged. The craftsmanship was amazing. I would recommend this to anyone looking for a gift and don't know what to get.",
        "rating": 5
    },
    {
        "id": 12,
        "description": "Received this today & the writing is horrible. It's dark & light; not all writing is the same color. Also, the color bleeds out, so it is not a clean look. This was supposed to be a gift & I am embarrassed to give it!!!",
        "rating": 2
    },
    {
        "id": 13,
        "description": "10 stars more if I could! I ordered this yesterday and it was delivered to me over night. I did not pay for over night shipping, I did pay for it to be expedited but this was crazy fast! Especially considering this is a personalized item. The quality is stunning. My clients will be so happy!! Thank you so much!",
        "rating": 5
    },
    {
        "id": 14,
        "description": "The photo shown when purchasing is a large cutting board that would cover a stove. What I got was the size of an envelope . I'm not positive the customization is correct bc I can't view my original order and when i requested contact with the seller it never happened.",
        "rating": 1
    },
    {
        "id": 15,
        "description": "If you look at the photo in the advertising with the tomatoes and garlic, you see a full-size cutting board. What you get is a miniature cheese board. Yes, buyer beware, shame on me for not checking the dimensions. But for $40.00 to get this tiny board is just false advertising, Stay away!",
        "rating": 1
    },
    {
        "id": 16,
        "description": "Not sturdy at all. The board broke in half only after a month of use.",
        "rating": 1
    },
    {
        "id": 17,
        "description": "It was nice until I saw my daughter's name misspelled.....her name is Lizzy not Liszt.....it took so long to get this one I doubt I can get another one before Christmas....",
        "rating": 1
    },
    {
        "id": 18,
        "description": "I had originally ordered this cutting board, it wasn’t what I was expecting, but the maker of this was so responsive and helped me out. Giving this as a Christmas present and they definitely helped me get my vision for what I needed. The customer service was amazing, really appreciated! Thank you!\n\nThe engravings are very accurate to what is promised as well and gives texture (not just printed on the board)",
        "rating": 5
    },
    {
        "id": 19,
        "description": "I had ordered this as a Christmas gift. The one who received it was absolutely set back when they opened the gift. Very well made and the artwork was fantastic. I made a good choice with this order.",
        "rating": 5
    },
    {
        "id": 20,
        "description": "NEVER buying an OtterBox case again, I wish I could rate this literally zero stars a hundred times.\n\nUsing it literally cracked my entire back plate from a very small drop. Incredibly upset was an understatement to what I was feeling when I picked this up hoping my OtterBox would have saved my phone. There were shards of glass everywhere that cut into my hand and was revealing the inside of the phone in some parts. Ever since I've been telling friends and family never to get these and will continue to so they don't have to pay hundreds to get the glass replaced.\n\nALSO, The phone not only Yellowed but parts of the bumper are coming off at where it connects to the back plastic case. The main reason I bought this was because they Marketed this BS as being different from other Clear cases as it doesn't Yellow!\n\nI always thought there was a reason for these to be so expensive but they're absolute JUNK!",
        "rating": 1
    },
    {
        "id": 21,
        "description": "I purchase the Otterbox case in April 2023. I have always trusted their product for protection and durability. However, this specific product only lasted 3 plus month before the product started to separate as shown in the photo. I will no longer spend $40 on a Otterbox phone case that lasted 3 months",
        "rating": 1
    },
    {
        "id": 22,
        "description": "Bought the case and within a week it began to yellow. (Almost 5 months later) the case has yellowed significantly and the rubber around the volume buttons is starting to fall apart and pull off the hard plastic part of the case the clear back of the case has fared better than other clear cases I’ve had. It has been mostly clear of scratches and scuffs. They do have a warranty that I’ll definitely be using to get a new case because spending $40 or $50 every 5 months gets annoying. Definitely don’t recommend getting a clear case if you don’t won’t it to yellow or fall apart.",
        "rating": 1
    },
    {
        "id": 23,
        "description": "Thought was getting a good deal. Case works ok but within 2 months it turned yellow. I work inside an office and phone spends most of the time in my pocket so not much sun exposure or heat exposure that would justify this case to yellow so quickly. Tried contacting manufacture but I have to pay for them to replace with the warranty and contact Amazon but are not willing to replace. Disappointed in otter box since I had no trouble with the previous cases that've ordere",
        "rating": 1
    },
    {
        "id": 24,
        "description": "My case started to yellow and scratch up very quickly. My case also started disfiguring too, and that’s never happened before. There’s a slight pull on the top left hand side that makes it lose its protectiveness.",
        "rating": 1
    },
    {
        "id": 25,
        "description": "This piece of garbage started to warp on me 6 months in, it doesn’t fully protect the case. otter box products have turned to trash",
        "rating": 1
    },
    {
        "id": 26,
        "description": "Thought was getting a good deal. Case works ok but within 2 months it turned yellow. I work inside an office and phone spends most of the time in my pocket so not much sun exposure or heat exposure that would justify this case to yellow so quickly. Tried contacting manufacture but I have to pay for them to replace with the warranty and contact Amazon but are not willing to replace. Disappointed in otter box since I had no trouble with the previous cases that've ordere.",
        "rating": 1
    },
    {
        "id": 27,
        "description": "This case DOES NOT fit the iphone 13 pro max. I tried to make this work. I felt like I was trying to force my iphone 13 pro max into it. I looked up installation and everything, because it shouldn't take force to apply a case to a phone, especially one that uses \"easy installation\" in the description. I came back to the product page and dove a bit deeper and others did in fact say that this doesn't fit the iphone 13 pro max. The box only says iphone 12 pro max, not iphone 13 pro max. Don't waste your time. So disappointed.",
        "rating": 1
    },
    {
        "id": 28,
        "description": "I am in a wheelchair which sits two and a half feet from the ground. My phone was on my leg. So, say three feet off the ground. My phone was bumped off my leg and fell to the ground. I picked it up and the back glass was broken. That’s inside the case! The front glass is still good. However the back glass cannot be replaced. Causing the phone to have to be replaced and deductible is really expensive. So no I would not recommend this to protect your phone that cost $1000 plus.",
        "rating": 1
    },
    {
        "id": 29,
        "description": "I dropped my phone from a desk face down three and a half feet and the entire back glass of my phone shattered, I had another otter box that took an absolute beating with a pop socket built into the case for extra grip without a glass screen protector that went through hell and never even got a scratch on my phone. This case is awful I don’t recommend at all and strongly hope they increase the width on the sides with more rubber in the future for better absorption of the shock.",
        "rating": 1
    },
    {
        "id": 30,
        "description": "It’s a quality case, holds form around the phone very comfortably, it’s not super slick and doesn’t slide everywhere. It’s quite durable and has bounced off a few walls and not even a mark on the case! The ring around the cameras sticks out enough to protect them but does prevent your phone from being perfectly flat when laid on its back. Not a deal breaker for me but might be for some. Don’t regret a single penny spent for this case.",
        "rating": 5
    },
    {
        "id": 31,
        "description": "I recommend this case. I do tend to drop my phone a lot and so far the case has done a good protecting it. I also added in a glass protector shield for the front and camera.",
        "rating": 5
    },
    {
        "id": 32,
        "description": "I’ve dropped my phone a couple of times since I put this case one. Phone and case are still in tact. That’s why I love Otterbox. The only problem is sometimes it does charge wirelessly well (if you have a non-Apple wireless charger). You have to finagle it a bit since the camera juts out. Other than that, the case does what it’s supposed to (besides, there are other ways to charge the phone) which is why I didn’t knock it down a star.",
        "rating": 5
    },
    {
        "id": 33,
        "description": "I have been a fan of this brand for many years and this case does not disappoint. I was using an (overly expensive) Apple mag safe case. It started to deteriorate. Bits of the silicone covering started to fall off. And since the beginning, the buttons were difficult to press. Enter OtterBox. This is a nice clear sturdy plastic case. The buttons may be activated with normal pressure. And I do like the antimicrobial feature of this case. Most definitely worth the money.",
        "rating": 5
    },
    {
        "id": 34,
        "description": "I bought this for my husband and he really likes it. We both bought the Apple brand ones and they cracked easily and discolored quickly. but this one he’s had for a while and has had no issues. Plus it has a nice grip and feel to it.",
        "rating": 5
    },
    {
        "id": 35,
        "description": "Good product...and was the right fit...just a bit tricky to install because the top edge seals sometimes don't snap into place snug...some have that silicone fold at the very edge that you have to pick-out to even or watch out for as you set your phone in. The magnetic thing also works...fits my old Pop-socket thingy just fine as the original apple one does...for the price this one is a great replacement. Very Pleased with the purcchase.",
        "rating": 5
    },
    {
        "id": 36,
        "description": "This case is nice a durable. I have young kids and always on the move. My iPhone pro max has been pushed off tables, fallen out of vehicles, dropped on the floor, and who knows what else and I have yet to crack my screen or have issues with my phone. I’m tough on my phone and this has proven to hold up to the tests. 5 stars!!!!!!!",
        "rating": 5
    },
    {
        "id": 37,
        "description": "Looks just like the other ones but way better quality. The cheaper versions don’t hug the phone like this one. Good price for the quality",
        "rating": 5
    },
    {
        "id": 38,
        "description": "Looks nice on the phone. Looks resistant, strong. I feel my phone is protected. Easy to put on and take off. Magsafe battery works perfect. Side bottoms work perfect. Highly recommend it!!",
        "rating": 5
    },
    {
        "id": 39,
        "description": "I am so happy I went with the almost new option and got it use. There was no evidence of being used other than no manufacture packaging. I got it for less than half off. I will definitely do it again. Shipping was fast.A+! Thankyou",
        "rating": 5
    },
    {
        "id": 40,
        "description": "Even though these mugs were specifically designed for Espresso, that isn’t why I bought them. For several years I’ve been buying bottles of Sparkling Ciders for New Years Day and for other occasions, during the year. The bottles say there is about three eight ounce servings per bottle. So I usually used a measuring cup to even it out. But I discovered that I could get closer to five servings by using these little mugs.I received these in time For a Birthday and served Sparkling Cider in them, which worked out perfectly. They are easy to hold and they are very lightweight, which surprised me. I expected them to be a bit heavier. I will admit I haven’t tried any hot drinks in these. Usually I want a twelve to sixteen ounce cup of coffee. A cup this size will probably just send me back for another cup. I love these! I’m considering buying two more sets, but one set will be given as a Christmas Gift.",
        "rating": 5
    },
    {
        "id": 41,
        "description": "TLDR: It's bulkier than expected, but the price is right and it works well. To be fair, I don't know why I didn't think about how large a 10 screen size kindle would be. It's not as if the product description was inaccurate. I just didn't really realize how much bigger this would be IRL as compared to the other kindle fires I have owned, until I held it for a couple of hours. (Photo for reference, with a kindle fire 7 on top of this model. Note also that I am tall and my hands are NOT small.)If I had bought this with the intention of using it mostly for streaming videos, I would have been very happy, as this is basically a full sized tablet. I got it mostly for use to read books, but it was on sale for cheaper than the simple reader versions so... why not?Well, it is just not great for hand-held reading. It's just too large, it's awkward to hold. I bought the case so I can prop it up on a table to read, but if you hold it in your hands in bed or on the train or whatever, I find this just a little to big to be comfortable, personally. It's actually more awkward than holding a physical book of the same size.If you want this as a tablet / mainly for video, then this is a great option and a great price. I have no complaints about the mechanism itself other than it seems to drain battery faster than previous models when wifi is on. All in all, it does its job well enough and the price was reasonable. It does everything I expected it to do.",
        "rating": 4
    },
    {
        "id": 42,
        "description": "This is a great little handheld steamer for occasional use. The rubber tag and stopper are very difficult and I have a feeling it will rip soon. But then I use mine every week so that is probably more often than ‘average’? Still, at this point in time, it’s a great steamer! Heats up quickly and is easy to hold and handle.",
        "rating": 5
    },
    {
        "id": 43,
        "description": "I had high hopes for this steamer on mornings that I’m rushing to get to work. I’ve discovered that you need to take your time to get good results. I had to go over a shirt several times very slowly to be effective. I’m going to keep it, but a little disappointed about how long it takes to work.",
        "rating": 3
    },
    {
        "id": 44,
        "description": "Great product! No need to brush the retainers, just let it soak for 15mins and it’s all clean. Would always repurchase",
        "rating": 5
    },
    {
        "id": 45,
        "description": "These work sooo well on my night guard. I highly recommend!!",
        "rating": 5
    },
    {
        "id": 46,
        "description": "I love the incremental measurements available for any recipe. They look wonderful and clean up is easy. I highly recommend this product.",
        "rating": 5
    },
    {
        "id": 47,
        "description": "I received these but they were missing the 1 cup. They have many different sizes and I had been using the 3/4 cup thinking it was the 1 cup. How very silly to be missing the 1 cup measuring cup.",
        "rating": 2
    },
    {
        "id": 48,
        "description": "I liked the opportunity to get a good cosmetic sponge without overpaying. They do become a nice size when damp. I just didn’t like that it doesn’t have a flat side, I found that I prefer that. They are definitely worth the great price though.",
        "rating": 4
    },
    {
        "id": 49,
        "description": "These are a great value and are very comparable to beauty blenders, however when you first rinse them the color dye does come out.",
        "rating": 4
    },
    {
        "id": 50,
        "description": "I like the way it looks for the price doesn’t look cheap. It doesn’t have all the fancy knobs for bagels etc. just a simple toaster which is what I wanted. I would recommend.",
        "rating": 4
    },
    {
        "id": 51,
        "description": "Burns bread on one side, not any good had to throw it in the trash do NOT waste your money, pay a bit more and get a toaster that works like a toaster.",
        "rating": 1
    },
    {
        "id": 52,
        "description": "This is a very small toaster. It doesn’t even take a normal bread slice…have to cut the slice in half to fit.Waste of money…..buy cheap, buy dear!",
        "rating": 1
    },
    {
        "id": 53,
        "description": "This shoe is made with lower quality materials than I expected. I'm not sure where the thousands of 5-star reviews are coming from. The velcro is really stiff and is rough--sharp along the top edge. It just feels cheaply made. The sole is bendable enough, and the shoe is fine overall. But for $40, I'm returning this and going back to the Saucany shoes we can get for the same price.The sizing is also off. I ordered a big kid size 12, and got a shoe labeled size 31. European size 31 corresponds to US size 13.5, so I'm surprised they didn't get the size conversion right.",
        "rating": 2
    },
    {
        "id": 54,
        "description": "These are not your typical Keen quality. They're extremely lightweight- and while thats not a problem, I've had target shoes that have held up better than these. They're also far too narrow for proper children's foot development. Give their tootsies some room to breath! My son does like the color however and that's a plus. They were good while they held up but overall Keen could have done much better with these.",
        "rating": 3
    },
    {
        "id": 55,
        "description": "I really wanted to like these and they were fine at first, but after a couple of wears, they stretch out and offer zero support. The band stretches and rides far up my back. Pretty disappointed. I’m tempted to size down and hope that when they stretched out they would fit better, but I don’t want to risk spending the money again and them still not fitting properly. Wish I could return but can’t since they’ve obviously been worn. :(",
        "rating": 1
    },
    {
        "id": 56,
        "description": "I love how lightweight and cute it is. Very easy to put together and switching the parts out is a breeze. I used it to clean my car.However I was not sent the screws needed for the mount and this vacuum will not stand up on its own.",
        "rating": 4
    },
    {
        "id": 57,
        "description": "Bought this to replace my small corded vacuum for everyday cleaning. Love the fact that I don’t have to keep bending down to plug and unplug. I also have outlet covers on all of my outlets as I have small children so this is a lifesaver. I have no carpet in my home FYI. The battery life is not the longest but it’s plenty to do a quick run through in my 1600 sqft house. Love how easy it glides & the fact that leaving it plugged in doesn’t weaken the battery over time. My kids love to use it also which helps me out! Worth the buy!!",
        "rating": 5
    },
    {
        "id": 58,
        "description": "It works well but the battery barely lasts long. But overall it's very practical and doesn't weigh anything!Easy to use and easy to clean. I love the design and the colors. So far no problem just the battery as I said before ",
        "rating": 4
    },
    {
        "id": 59,
        "description": "I currently use two of these switches along with 8 wall switches and I'm satisfied for the price. Now that there is a smart button I think I'll use these even more. Great for holiday lighting.",
        "rating": 5
    },
    {
        "id": 60,
        "description": "Great gardening shoe Update 7/27…. about a week or so with the shoes and I was wrong. They really stink. Lol. I purposely keep them wet though, so that’s on me. I just thought with being water shoes they would not stink when wet but that’s OK. The insoles are not attached so they come out a lot but it’s an easy slip back in. Still love them though .great for my purpose which is just gardening around the house I got these specifically for working in my flower garden. My garden is huge and is a mix of rocks, steppingstones, and dirt. I purposely keep my feet wet while I am gardening. It keeps me a little cooler, and the best part is when I am finished, my feet are clean when I take the shoes off. And they don’t smell! I wear a size 7 shoe and bought a size 7.5 and they fit perfectly. They are lightweight, but yet there’s actually some sole on my foot, enough, where I don’t get stung by bees and rocks don’t hurt. I wish I had bought these years ago. I have trashed so many pairs of shoes and also my feet by wearing flip-flops many times..",
        "rating": 5
    },
    {
        "id": 61,
        "description": "disappointed I can't really give a fair review for this set of Philips TAT4506 earbuds. Was looking forward to having 6 hours of play time and 3 full charges from the case. Sadly, the earbuds would not hold any kind of charge. Right after the earbuds would connect, a \"low battery\" message would be heard. In a matter of seconds, they would turn off. The contacts were cleaned to make sure the device was getting a charge from the case, but that didn't help. Maybe these were old stock and the batteries are just bad, but I have no way to guarantee a fresh device.",
        "rating": 1
    },
    {
        "id": 62,
        "description": "Worst product ever Ordered a pair. Charged up the case, but the headphones themselves never charged. Put them in my ear and they said \"Low battery\" and went off. Returned them to Amazon. Got a second pair -- same thing. Called Philips' tech support -- \"We don't support that product.\" Don't waste your money. Spend a little more. The Philips T5506 cost more, but are like the best headphones ever.",
        "rating": 1
    },
    {
        "id": 63,
        "description": "volume from microphone is too low Quality of sound is fine. It is directional and you need to talk into the top of the microphone not the sides. It is slightly heavy but so is the receiver. Problem is that the sound volume in the iPhone is too low. I will have to return.",
        "rating": 2
    },
    {
        "id": 64,
        "description": "Runs hot unless you put little heat sinks on it. RANDOMLY DISCONNECTS and needs to be reconnected. This works well enough for me use my computer with my screen, mouse, and keyboard (attached to a USB hub) in another room. But the female end runs hot. As another reviewer suggested, this is fixable by putting little heat sinks on it. I used two sets of https://www.amazon.com/Geekworm-Raspberry-Heatsinks-Conductive-Compatible/dp/B0B2CP1G23 and they seem to work well enough. Here's what really gets on my nerves: It randomly disconnects, forcing me to go to the room in which my computer is, and re-plug the male ends. It happens at least once a day. So annoying. Other than that SUPER-ANNOYING issue, I've been using this for a couple of months and it has been working well. I may lower this review to one star in the future if performance deteriorates further. I may just have to change my motherboard in order to be able to use Corning's Thunderbolt 3 cable instead, as that seems much more reliable, based on current reviews.",
        "rating": 2
    },
    {
        "id": 65,
        "description": "Breaks easily Within the first 5-10 minutes of having this on it busted it is not the best zag product. I upgraded to the Curve Elite since this one wasn’t as good.",
        "rating": 1
    },
    {
        "id": 66,
        "description": "High Specs, Low Satisfaction In the gaming world, the lure of high specs can often be alluring, and that's what drew me to the GIGABYTE AERO 17 YE5. But, as I quickly discovered, stellar specs on paper don't always translate to a satisfying gaming experience. Let's start with the ports. In today's age of extensive peripherals and devices, the lack of versatile ports on this machine is a significant misstep. They ship an adapter for even the most basic connections. This feels like an unnecessary hassle, especially for a laptop in this price range. Next up is the display. Yes, it's a 4K/UHD miniLED screen with 120Hz refresh rate, which sounds amazing in theory. However, the brightness of the screen is overpowering, to say the least. Even after tinkering with the settings, the brightness makes visuals appear washed out, compromising the gaming experience and causing unnecessary eye strain. The most concerning issue, however, is the heat. The AERO 17's thermal performance is problematic. It runs incredibly hot, even during low-resource gaming or simple web browsing. I'm not sure if it's a design flaw or a lack of efficient cooling solutions, but a laptop this premium shouldn't have such glaring thermal issues. Finally, there's the software. While it comes packed with tons of pre-installed utilities, many are redundant, and the constant prompts and notifications are downright annoying. Some could argue that these are easy to disable, but why have them in the first place? Overall, I found the GIGABYTE AERO 17 YE5 to be a mix of high specs and low satisfaction. It has potential, but these issues, especially the thermal ones, are hard to overlook. Unless the brand addresses these problems in subsequent iterations, I can't recommend this product to other gamers.",
        "rating": 2
    },
    {
        "id": 67,
        "description": "Not worth the price I purchased this because I heard great things about the air purifier. Upon getting it, I was greatly disappointed. Not only was the price incredibly high for what you're getting, but the product itself did not meet expectations. The design is clunky, taking up a lot of space on my countertop. Additionally, while it does purify the air, I did not notice a significant change in the quality of the air in my home. There are cheaper alternatives on the market that do a better job at purifying. I would not recommend this product.",
        "rating": 2
    },
    {
        "id": 68,
        "description": "The perfect hiking companion I've tried various shoes for hiking, but this particular pair surpasses them all. They're comfortable, offer great traction, and are incredibly durable. I've gone on several hikes with these shoes and they've never failed me. Not to mention, they're also stylish and can be worn casually. A great investment for anyone who loves the outdoors.",
        "rating": 5
    },
    {
        "id": 69,
        "description": "High price for mediocre performance This vacuum cleaner boasts of high suction power and an array of features. However, when it comes to actual cleaning performance, it leaves a lot to be desired. It struggles with pet hair and larger debris, and the battery life is underwhelming. There are better options available at a lower price point.",
        "rating": 2
    },
    {
        "id": 70,
        "description": "Junk Locking up after driving the truck 3 times.",
        "rating": 1
    },
    {
        "id": 71,
        "description": "Waste of money. Advertized as pre installed cleats, they were not. The delta cleats are very difficult to get on. Once they are on the shoes get stuck and cannot come off of the peleton. One of them came off the peleton and the screws on the cleat fell out. Very disappointed.",
        "rating": 2
    },
    {
        "id": 72,
        "description": "Look great and is heavy. I gave this watch to a close friend as a 40th birthday present. Beautiful watch, but it is very heavy. Heavy is not necessary bad if you don't mind it. Definitely does not appear or feel cheap in any way.",
        "rating": 5
    },
    {
        "id": 73,
        "description": "A Perfect Fit! When ordering a belt online, you hope that what you're reading is spot on and that was this was completely. The product is great. The brand perfect. And, receiving the product on time was a nice plus. Kudos to the seller. Thank you.",
        "rating": 5
    },
    {
        "id": 74,
        "description": "Simply The BEST!!! These are the best baby/child nail clippers hands down. I would not be able to see my daughter’s nails without the built in light. I’ve rarely clipped her cuticles or too short. My daughter sits calmly while I clip away on a weekly basis. I’ve been using this brand and type since my daughter was born and she’s three now. I’m on my 3rd pair. The 1st pair broke after a couple years. I dropped the 2nd pair in the toilet by accident so the light quit working. I was lost without them so bought another pair right away. They are definitely worth it.",
        "rating": 5
    },
    {
        "id": 75,
        "description": "It's fine. For the price I'm fine with this soap. I guess that after 25 years of using shaving soap, I'm a little disappointed in the sudden hipster trend and the price gouging that is going on with what are supposed to be higher end products. I chose this soap because I felt it was a fair price. The scent out of the package was amazing and I was very excited about using it for the first time. Since then the scent has faded to near nonexistence, which is too bad because the Bay Rum was very nice. Overall the soap is adequate, though so far it's little better than decent hand soap. For the price I suppose I would recommend it, though the soaps that have been around for decades still seem to do it better at this price.",
        "rating": 4
    },
    {
        "id": 76,
        "description": "Worked. These bracelets were comfortable, big enough to fit my ankles, and the colors were cute. They did repel mosquitoes but only close to the bracelets themselves. Where I was camping, the mosquitoes were really bad and my lower arms were not bit at all. I did get bit from my elbows up, but if I noticed the mosquitoes, they quickly flew away as soon as I waved my hands at them. Normally when I wave off mosquitoes, they just fly away from my hand and try to land somewhere else on my body. Not this time. This time they flew completely away. Since I wore long pants with sandals, my legs and feet were not bit at all. In other words, they were not as effective as I wanted, but still effective.",
        "rating": 4
    },
    {
        "id": 77,
        "description": "Perfect for Page-A-Day Calendars! I needed a stand for my page-a-day calendar because the built-in cardboard stand kept collapsing. This is perfect! I did have to remove the cardboard backing from the calendar to make it fit, but otherwise it’s been the perfect solution. Good quality for what it is.",
        "rating": 5
    },
    {
        "id": 78,
        "description": "Strong nice scent! I didn’t even take out of the bag it comes in and just put on a shelf. The whole bedroom smells so nice like roses! Will def purchase again when scent diminishes or will buy the oil to add to the current one. I love that it’s strong scented!",
        "rating": 5
    },
    {
        "id": 79,
        "description": "Great product. Love Myra products. This is a cute back pack and fits all I need it to. However it is a little smaller than I thought it was going to be but still have plenty of room. The back pocket is perfect for conceal carry. The color is more green then the turquoise as shown in the picture but I still love it.",
        "rating": 4
    },
    {
        "id": 80,
        "description": "Beautiful Glasses! These exceeded my expectations! Very well made and easier to wash than I first expected. It seems like they are quite universal. They work well for both Scotch and Liqueurs of all kinds. Price was affordable for the set of 4. Would recommend!",
        "rating": 5
    }
]