[
    {
      "id": 21,
      "description": "Great gardening shoe Update 7/27…. about a week or so with the shoes and I was wrong. They really stink. Lol. I purposely keep them wet though, so that’s on me. I just thought with being water shoes they would not stink when wet but that’s OK. The insoles are not attached so they come out a lot but it’s an easy slip back in. Still love them though .great for my purpose which is just gardening around the house I got these specifically for working in my flower garden. My garden is huge and is a mix of rocks, steppingstones, and dirt. I purposely keep my feet wet while I am gardening. It keeps me a little cooler, and the best part is when I am finished, my feet are clean when I take the shoes off. And they don’t smell! I wear a size 7 shoe and bought a size 7.5 and they fit perfectly. They are lightweight, but yet there’s actually some sole on my foot, enough, where I don’t get stung by bees and rocks don’t hurt. I wish I had bought these years ago. I have trashed so many pairs of shoes and also my feet by wearing flip-flops many times..",
      "rating": 5
    },
    {
      "id": 22,
      "description": "disappointed I can't really give a fair review for this set of Philips TAT4506 earbuds. Was looking forward to having 6 hours of play time and 3 full charges from the case. Sadly, the earbuds would not hold any kind of charge. Right after the earbuds would connect, a \"low battery\" message would be heard. In a matter of seconds, they would turn off. The contacts were cleaned to make sure the device was getting a charge from the case, but that didn't help. Maybe these were old stock and the batteries are just bad, but I have no way to guarantee a fresh device.",
      "rating": 1
    },
    {
      "id": 23,
      "description": "Worst product ever Ordered a pair. Charged up the case, but the headphones themselves never charged. Put them in my ear and they said \"Low battery\" and went off. Returned them to Amazon. Got a second pair -- same thing. Called Philips' tech support -- \"We don't support that product.\" Don't waste your money. Spend a little more. The Philips T5506 cost more, but are like the best headphones ever.",
      "rating": 1
    },
    {
      "id": 24,
      "description": "volume from microphone is too low Quality of sound is fine. It is directional and you need to talk into the top of the microphone not the sides. It is slightly heavy but so is the receiver. Problem is that the sound volume in the iPhone is too low. I will have to return.",
      "rating": 2
    },
    {
      "id": 25,
      "description": "Runs hot unless you put little heat sinks on it. RANDOMLY DISCONNECTS and needs to be reconnected. This works well enough for me use my computer with my screen, mouse, and keyboard (attached to a USB hub) in another room. But the female end runs hot. As another reviewer suggested, this is fixable by putting little heat sinks on it. I used two sets of https://www.amazon.com/Geekworm-Raspberry-Heatsinks-Conductive-Compatible/dp/B0B2CP1G23 and they seem to work well enough. Here's what really gets on my nerves: It randomly disconnects, forcing me to go to the room in which my computer is, and re-plug the male ends. It happens at least once a day. So annoying. Other than that SUPER-ANNOYING issue, I've been using this for a couple of months and it has been working well. I may lower this review to one star in the future if performance deteriorates further. I may just have to change my motherboard in order to be able to use Corning's Thunderbolt 3 cable instead, as that seems much more reliable, based on current reviews.",
      "rating": 2
    },
    {
      "id": 26,
      "description": "Breaks easily Within the first 5-10 minutes of having this on it busted it is not the best zag product. I upgraded to the Curve Elite since this one wasn’t as good.",
      "rating": 1
    },
    {
      "id": 27,
      "description": "High Specs, Low Satisfaction In the gaming world, the lure of high specs can often be alluring, and that's what drew me to the GIGABYTE AERO 17 YE5. But, as I quickly discovered, stellar specs on paper don't always translate to a satisfying gaming experience. Let's start with the ports. In today's age of extensive peripherals and devices, the lack of versatile ports on this machine is a significant misstep. They ship an adapter for even the most basic connections. This feels like an unnecessary hassle, especially for a laptop in this price range. Next up is the display. Yes, it's a 4K/UHD miniLED screen with 120Hz refresh rate, which sounds amazing in theory. However, the brightness of the screen is overpowering, to say the least. Even after tinkering with the settings, the brightness makes visuals appear washed out, compromising the gaming experience and causing unnecessary eye strain. The most concerning issue, however, is the heat. The AERO 17's thermal performance is problematic. It runs incredibly hot, even during low-resource gaming or simple web browsing. I'm not sure if it's a design flaw or a lack of efficient cooling solutions, but a laptop this premium shouldn't have such glaring thermal issues. Finally, there's the software. While it comes packed with tons of pre-installed utilities, many are redundant, and the constant prompts and notifications are downright annoying. Some could argue that these are easy to disable, but why have them in the first place? Overall, I found the GIGABYTE AERO 17 YE5 to be a mix of high specs and low satisfaction. It has potential, but these issues, especially the thermal ones, are hard to overlook. Unless the brand addresses these problems in subsequent iterations, I can't recommend this product to other gamers.",
      "rating": 2
    },
    {
      "id": 28,
      "description": "Not worth the price I purchased this because I heard great things about the air purifier. Upon getting it, I was greatly disappointed. Not only was the price incredibly high for what you're getting, but the product itself did not meet expectations. The design is clunky, taking up a lot of space on my countertop. Additionally, while it does purify the air, I did not notice a significant change in the quality of the air in my home. There are cheaper alternatives on the market that do a better job at purifying. I would not recommend this product.",
      "rating": 2
    },
   {
      "id": 29,
      "description": "The perfect hiking companion I've tried various shoes for hiking, but this particular pair surpasses them all. They're comfortable, offer great traction, and are incredibly durable. I've gone on several hikes with these shoes and they've never failed me. Not to mention, they're also stylish and can be worn casually. A great investment for anyone who loves the outdoors.",
      "rating": 5
    },
    {
      "id": 30,
      "description": "High price for mediocre performance This vacuum cleaner boasts of high suction power and an array of features. However, when it comes to actual cleaning performance, it leaves a lot to be desired. It struggles with pet hair and larger debris, and the battery life is underwhelming. There are better options available at a lower price point.",
      "rating": 2
    },
  {
      "id": 31,
      "description": "Junk Locking up after driving the truck 3 times.",
      "rating": 1
    },
    {
      "id": 32,
      "description": "Waste of money. Advertized as pre installed cleats, they were not. The delta cleats are very difficult to get on. Once they are on the shoes get stuck and cannot come off of the peleton. One of them came off the peleton and the screws on the cleat fell out. Very disappointed.",
      "rating": 2
    },
    {
      "id": 33,
      "description": "Look great and is heavy. I gave this watch to a close friend as a 40th birthday present. Beautiful watch, but it is very heavy. Heavy is not necessary bad if you don't mind it. Definitely does not appear or feel cheap in any way.",
      "rating": 5
    },
    {
      "id": 34,
      "description": "A Perfect Fit! When ordering a belt online, you hope that what you're reading is spot on and that was this was completely. The product is great. The brand perfect. And, receiving the product on time was a nice plus. Kudos to the seller. Thank you.",
      "rating": 5
    },
    {
      "id": 35,
      "description": "Simply The BEST!!! These are the best baby/child nail clippers hands down. I would not be able to see my daughter’s nails without the built in light. I’ve rarely clipped her cuticles or too short. My daughter sits calmly while I clip away on a weekly basis. I’ve been using this brand and type since my daughter was born and she’s three now. I’m on my 3rd pair. The 1st pair broke after a couple years. I dropped the 2nd pair in the toilet by accident so the light quit working. I was lost without them so bought another pair right away. They are definitely worth it.",
      "rating": 5
    },
    {
      "id": 36,
      "description": "It's fine. For the price I'm fine with this soap. I guess that after 25 years of using shaving soap, I'm a little disappointed in the sudden hipster trend and the price gouging that is going on with what are supposed to be higher end products. I chose this soap because I felt it was a fair price. The scent out of the package was amazing and I was very excited about using it for the first time. Since then the scent has faded to near nonexistence, which is too bad because the Bay Rum was very nice. Overall the soap is adequate, though so far it's little better than decent hand soap. For the price I suppose I would recommend it, though the soaps that have been around for decades still seem to do it better at this price.",
      "rating": 4
    },
    {
      "id": 37,
      "description": "Worked. These bracelets were comfortable, big enough to fit my ankles, and the colors were cute. They did repel mosquitoes but only close to the bracelets themselves. Where I was camping, the mosquitoes were really bad and my lower arms were not bit at all. I did get bit from my elbows up, but if I noticed the mosquitoes, they quickly flew away as soon as I waved my hands at them. Normally when I wave off mosquitoes, they just fly away from my hand and try to land somewhere else on my body. Not this time. This time they flew completely away. Since I wore long pants with sandals, my legs and feet were not bit at all. In other words, they were not as effective as I wanted, but still effective.",
      "rating": 4
    },
    {
      "id": 38,
      "description": "Perfect for Page-A-Day Calendars! I needed a stand for my page-a-day calendar because the built-in cardboard stand kept collapsing. This is perfect! I did have to remove the cardboard backing from the calendar to make it fit, but otherwise it’s been the perfect solution. Good quality for what it is.",
      "rating": 5
    },
    {
      "id": 39,
      "description": "Strong nice scent! I didn’t even take out of the bag it comes in and just put on a shelf. The whole bedroom smells so nice like roses! Will def purchase again when scent diminishes or will buy the oil to add to the current one. I love that it’s strong scented!",
      "rating": 5
    },
    {
      "id": 40,
      "description": "Great product. Love Myra products. This is a cute back pack and fits all I need it to. However it is a little smaller than I thought it was going to be but still have plenty of room. The back pocket is perfect for conceal carry. The color is more green then the turquoise as shown in the picture but I still love it.",
      "rating": 4
    },
    {
      "id": 41,
      "description": "Beautiful Glasses! These exceeded my expectations! Very well made and easier to wash than I first expected. It seems like they are quite universal. They work well for both Scotch and Liqueurs of all kinds. Price was affordable for the set of 4. Would recommend!",
      "rating": 5
    }
  ]
  