[
    {
        "id": 1,
        "description": "Even though these mugs were specifically designed for Espresso, that isn’t why I bought them. For several years I’ve been buying bottles of Sparkling Ciders for New Years Day and for other occasions, during the year. The bottles say there is about three eight ounce servings per bottle. So I usually used a measuring cup to even it out. But I discovered that I could get closer to five servings by using these little mugs.I received these in time For a Birthday and served Sparkling Cider in them, which worked out perfectly. They are easy to hold and they are very lightweight, which surprised me. I expected them to be a bit heavier. I will admit I haven’t tried any hot drinks in these. Usually I want a twelve to sixteen ounce cup of coffee. A cup this size will probably just send me back for another cup. I love these! I’m considering buying two more sets, but one set will be given as a Christmas Gift.",
        "rating": 5
    },
    {
        "id": 2,
        "description": "TLDR: It's bulkier than expected, but the price is right and it works well. To be fair, I don't know why I didn't think about how large a 10 screen size kindle would be. It's not as if the product description was inaccurate. I just didn't really realize how much bigger this would be IRL as compared to the other kindle fires I have owned, until I held it for a couple of hours. (Photo for reference, with a kindle fire 7 on top of this model. Note also that I am tall and my hands are NOT small.)If I had bought this with the intention of using it mostly for streaming videos, I would have been very happy, as this is basically a full sized tablet. I got it mostly for use to read books, but it was on sale for cheaper than the simple reader versions so... why not?Well, it is just not great for hand-held reading. It's just too large, it's awkward to hold. I bought the case so I can prop it up on a table to read, but if you hold it in your hands in bed or on the train or whatever, I find this just a little to big to be comfortable, personally. It's actually more awkward than holding a physical book of the same size.If you want this as a tablet / mainly for video, then this is a great option and a great price. I have no complaints about the mechanism itself other than it seems to drain battery faster than previous models when wifi is on. All in all, it does its job well enough and the price was reasonable. It does everything I expected it to do.",
        "rating": 4
    },
    {
        "id": 3,
        "description": "This is a great little handheld steamer for occasional use. The rubber tag and stopper are very difficult and I have a feeling it will rip soon. But then I use mine every week so that is probably more often than ‘average’? Still, at this point in time, it’s a great steamer! Heats up quickly and is easy to hold and handle.",
        "rating": 5
    },
    {
        "id": 4,
        "description": "I had high hopes for this steamer on mornings that I’m rushing to get to work. I’ve discovered that you need to take your time to get good results. I had to go over a shirt several times very slowly to be effective. I’m going to keep it, but a little disappointed about how long it takes to work.",
        "rating": 3
    },
    {
        "id": 5,
        "description": "Great product! No need to brush the retainers, just let it soak for 15mins and it’s all clean. Would always repurchase",
        "rating": 5
    },
    {
        "id": 6,
        "description": "These work sooo well on my night guard. I highly recommend!!",
        "rating": 5
    },
    {
        "id": 7,
        "description": "I love the incremental measurements available for any recipe. They look wonderful and clean up is easy. I highly recommend this product.",
        "rating": 5
    },
    {
        "id": 8,
        "description": "I received these but they were missing the 1 cup. They have many different sizes and I had been using the 3/4 cup thinking it was the 1 cup. How very silly to be missing the 1 cup measuring cup.",
        "rating": 2
    },
    {
        "id": 9,
        "description": "I liked the opportunity to get a good cosmetic sponge without overpaying. They do become a nice size when damp. I just didn’t like that it doesn’t have a flat side, I found that I prefer that. They are definitely worth the great price though.",
        "rating": 4
    },
    {
        "id": 10,
        "description": "These are a great value and are very comparable to beauty blenders, however when you first rinse them the color dye does come out.",
        "rating": 4
    },
    {
        "id": 11,
        "description": "I like the way it looks for the price doesn’t look cheap. It doesn’t have all the fancy knobs for bagels etc. just a simple toaster which is what I wanted. I would recommend.",
        "rating": 4
    },
    {
        "id": 12,
        "description": "Burns bread on one side, not any good had to throw it in the trash do NOT waste your money, pay a bit more and get a toaster that works like a toaster.",
        "rating": 1
    },
    {
        "id": 13,
        "description": "This is a very small toaster. It doesn’t even take a normal bread slice…have to cut the slice in half to fit.Waste of money…..buy cheap, buy dear!",
        "rating": 1
    },
    {
        "id": 14,
        "description": "This shoe is made with lower quality materials than I expected. I'm not sure where the thousands of 5-star reviews are coming from. The velcro is really stiff and is rough--sharp along the top edge. It just feels cheaply made. The sole is bendable enough, and the shoe is fine overall. But for $40, I'm returning this and going back to the Saucany shoes we can get for the same price.The sizing is also off. I ordered a big kid size 12, and got a shoe labeled size 31. European size 31 corresponds to US size 13.5, so I'm surprised they didn't get the size conversion right.",
        "rating": 2
    },
    {
        "id": 15,
        "description": "These are not your typical Keen quality. They're extremely lightweight- and while thats not a problem, I've had target shoes that have held up better than these. They're also far too narrow for proper children's foot development. Give their tootsies some room to breath! My son does like the color however and that's a plus. They were good while they held up but overall Keen could have done much better with these.",
        "rating": 3
    },
    {
        "id": 16,
        "description": "I really wanted to like these and they were fine at first, but after a couple of wears, they stretch out and offer zero support. The band stretches and rides far up my back. Pretty disappointed. I’m tempted to size down and hope that when they stretched out they would fit better, but I don’t want to risk spending the money again and them still not fitting properly. Wish I could return but can’t since they’ve obviously been worn. :(",
        "rating": 1
    },
    {
        "id": 17,
        "description": "I love how lightweight and cute it is. Very easy to put together and switching the parts out is a breeze. I used it to clean my car.However I was not sent the screws needed for the mount and this vacuum will not stand up on its own.",
        "rating": 4
    },
    {
        "id": 18,
        "description": "Bought this to replace my small corded vacuum for everyday cleaning. Love the fact that I don’t have to keep bending down to plug and unplug. I also have outlet covers on all of my outlets as I have small children so this is a lifesaver. I have no carpet in my home FYI. The battery life is not the longest but it’s plenty to do a quick run through in my 1600 sqft house. Love how easy it glides & the fact that leaving it plugged in doesn’t weaken the battery over time. My kids love to use it also which helps me out! Worth the buy!!",
        "rating": 5
    },
    {
        "id": 19,
        "description": "It works well but the battery barely lasts long. But overall it's very practical and doesn't weigh anything!Easy to use and easy to clean. I love the design and the colors. So far no problem just the battery as I said before ",
        "rating": 4
    },
    {
        "id": 20,
        "description": "I currently use two of these switches along with 8 wall switches and I'm satisfied for the price. Now that there is a smart button I think I'll use these even more. Great for holiday lighting.",
        "rating": 5
    }
]