[
  {
    "id": 0,
    "description": "Absolutely love this sheet set. There are a lot of sheet sets that claim to be soft but are disappointingly not. Fortunately, these sheets are exactly what they claim and are super soft. I would definitely buy these again.",
    "rating": 5
  },
  {
    "id": 1,
    "description": "First, it was missing the pillow case. Next, they’re crazy thin. Very cheap. Soft but cheap.",
    "rating": 2
  },
  {
    "id": 2,
    "description": "Although the fabric is soft, and okay to the feel, it’s not all that great a product. The stitching is awful. After 2 washings, the seams are coming apart on the fitted sheet. When folding the sheets I noticed that the fabric has become lopped sided, so it doesn’t fold and store nicely. Even the flat sheet and pillow cases.",
    "rating": 2
  },
  {
    "id": 3,
    "description": "Married into a family so I now have 2 granddaughters ages 2 and 5. I went out and bought comforters and wanted sheets to match. These are perfect. The quality is nice wasn't peeled yet.",
    "rating": 5
  },
  {
    "id": 4,
    "description": "Would give 5/5 but just waiting to see how they hold up over time. So far, they look great and are super soft to the touch. Definitely a good, economic choice for soft sheets",
    "rating": 5
  },
  {
    "id": 5,
    "description": "Coconut milk color was a pale yellow instead, they are incredibly thin, and not the same brand as original labeled when purchased. The reviews gave me high hopes but these are overall sad. Even worse I bought several for my rental",
    "rating": 1
  },
  {
    "id": 6,
    "description": "Pretty pink color, extremely soft to the touch.\nI even like the elastic they way it's made. Bought another\nsheet set and it had one continuous elastic that if it broke\nin one place the whole thing would not have an elastic in it.\nHowever they are a bit thin.",
    "rating": 5
  },
  {
    "id": 7,
    "description": "We purchased the sheets for our guest room. Our guests said they had the best night’s sleep. They commented that the sheets were soft, cool and they loved them. Would buy again.",
    "rating": 5
  },
  {
    "id": 8,
    "description": "Poor quality. Pillow case arrived torn at the seams.",
    "rating": 1
  },
  {
    "id": 9,
    "description": "If you get the color \"coconut milk\" like I did, it does not look like the picture which is more of a cream color. These have a gross yellowish tinge to it that is completely unusable in my color scheme and past the return window. I've never had a problem with their colors being so off before and the sheet set didn't say Cathay on them but some other brand. So pay attention quickly so you can return them if the color is off.",
    "rating": 5
  },
  {
    "id": 10,
    "description": "I was missing my pillow cases",
    "rating": 2
  },
  {
    "id": 11,
    "description": "I bought this as a wedding gift for one of my staff. She loves to prepare meals so I thought this would be a good idea for her. She can't stop talking about it. I got the stand to go with it which I think is a must buy. It came in the mail and it was well packaged. The craftsmanship was amazing. I would recommend this to anyone looking for a gift and don't know what to get.",
    "rating": 5
  },
  {
    "id": 12,
    "description": "Received this today & the writing is horrible. It's dark & light; not all writing is the same color. Also, the color bleeds out, so it is not a clean look. This was supposed to be a gift & I am embarrassed to give it!!!",
    "rating": 2
  },
  {
    "id": 13,
    "description": "10 stars more if I could! I ordered this yesterday and it was delivered to me over night. I did not pay for over night shipping, I did pay for it to be expedited but this was crazy fast! Especially considering this is a personalized item. The quality is stunning. My clients will be so happy!! Thank you so much!",
    "rating": 5
  },
  {
    "id": 14,
    "description": "The photo shown when purchasing is a large cutting board that would cover a stove. What I got was the size of an envelope . I'm not positive the customization is correct bc I can't view my original order and when i requested contact with the seller it never happened.",
    "rating": 1
  },
  {
    "id": 15,
    "description": "If you look at the photo in the advertising with the tomatoes and garlic, you see a full-size cutting board. What you get is a miniature cheese board. Yes, buyer beware, shame on me for not checking the dimensions. But for $40.00 to get this tiny board is just false advertising, Stay away!",
    "rating": 1
  },
  {
    "id": 16,
    "description": "Not sturdy at all. The board broke in half only after a month of use.",
    "rating": 1
  },
  {
    "id": 17,
    "description": "It was nice until I saw my daughter's name misspelled.....her name is Lizzy not Liszt.....it took so long to get this one I doubt I can get another one before Christmas....",
    "rating": 1
  },
  {
    "id": 18,
    "description": "I had originally ordered this cutting board, it wasn’t what I was expecting, but the maker of this was so responsive and helped me out. Giving this as a Christmas present and they definitely helped me get my vision for what I needed. The customer service was amazing, really appreciated! Thank you!\n\nThe engravings are very accurate to what is promised as well and gives texture (not just printed on the board)",
    "rating": 5
  },
  {
    "id": 19,
    "description": "I had ordered this as a Christmas gift. The one who received it was absolutely set back when they opened the gift. Very well made and the artwork was fantastic. I made a good choice with this order.",
    "rating": 5
  }
]