[
    {
      "id": 21,
      "description": "NEVER buying an OtterBox case again, I wish I could rate this literally zero stars a hundred times.\n\nUsing it literally cracked my entire back plate from a very small drop. Incredibly upset was an understatement to what I was feeling when I picked this up hoping my OtterBox would have saved my phone. There were shards of glass everywhere that cut into my hand and was revealing the inside of the phone in some parts. Ever since I've been telling friends and family never to get these and will continue to so they don't have to pay hundreds to get the glass replaced.\n\nALSO, The phone not only Yellowed but parts of the bumper are coming off at where it connects to the back plastic case. The main reason I bought this was because they Marketed this BS as being different from other Clear cases as it doesn't Yellow!\n\nI always thought there was a reason for these to be so expensive but they're absolute JUNK!",
      "rating": 1
    },
    {
      "id": 22,
      "description": "I purchase the Otterbox case in April 2023. I have always trusted their product for protection and durability. However, this specific product only lasted 3 plus month before the product started to separate as shown in the photo. I will no longer spend $40 on a Otterbox phone case that lasted 3 months",
      "rating": 1
    },
    {
      "id": 23,
      "description": "Bought the case and within a week it began to yellow. (Almost 5 months later) the case has yellowed significantly and the rubber around the volume buttons is starting to fall apart and pull off the hard plastic part of the case the clear back of the case has fared better than other clear cases I’ve had. It has been mostly clear of scratches and scuffs. They do have a warranty that I’ll definitely be using to get a new case because spending $40 or $50 every 5 months gets annoying. Definitely don’t recommend getting a clear case if you don’t won’t it to yellow or fall apart.",
      "rating": 1
    },
    {
      "id": 24,
      "description": "Thought was getting a good deal. Case works ok but within 2 months it turned yellow. I work inside an office and phone spends most of the time in my pocket so not much sun exposure or heat exposure that would justify this case to yellow so quickly. Tried contacting manufacture but I have to pay for them to replace with the warranty and contact Amazon but are not willing to replace. Disappointed in otter box since I had no trouble with the previous cases that've ordere",
      "rating": 1
    },
    {
      "id": 25,
      "description": "My case started to yellow and scratch up very quickly. My case also started disfiguring too, and that’s never happened before. There’s a slight pull on the top left hand side that makes it lose its protectiveness.",
      "rating": 1
    },
    {
      "id": 26,
      "description": "This piece of garbage started to warp on me 6 months in, it doesn’t fully protect the case. otter box products have turned to trash",
      "rating": 1
    },
    {
      "id": 27,
      "description": "Thought was getting a good deal. Case works ok but within 2 months it turned yellow. I work inside an office and phone spends most of the time in my pocket so not much sun exposure or heat exposure that would justify this case to yellow so quickly. Tried contacting manufacture but I have to pay for them to replace with the warranty and contact Amazon but are not willing to replace. Disappointed in otter box since I had no trouble with the previous cases that've ordere.",
      "rating": 1
    },
    {
      "id": 28,
      "description": "This case DOES NOT fit the iphone 13 pro max. I tried to make this work. I felt like I was trying to force my iphone 13 pro max into it. I looked up installation and everything, because it shouldn't take force to apply a case to a phone, especially one that uses \"easy installation\" in the description. I came back to the product page and dove a bit deeper and others did in fact say that this doesn't fit the iphone 13 pro max. The box only says iphone 12 pro max, not iphone 13 pro max. Don't waste your time. So disappointed.",
      "rating": 1
    },
    {
      "id": 29,
      "description": "I am in a wheelchair which sits two and a half feet from the ground. My phone was on my leg. So, say three feet off the ground. My phone was bumped off my leg and fell to the ground. I picked it up and the back glass was broken. That’s inside the case! The front glass is still good. However the back glass cannot be replaced. Causing the phone to have to be replaced and deductible is really expensive. So no I would not recommend this to protect your phone that cost $1000 plus.",
      "rating": 1
    },
    {
      "id": 30,
      "description": "I dropped my phone from a desk face down three and a half feet and the entire back glass of my phone shattered, I had another otter box that took an absolute beating with a pop socket built into the case for extra grip without a glass screen protector that went through hell and never even got a scratch on my phone. This case is awful I don’t recommend at all and strongly hope they increase the width on the sides with more rubber in the future for better absorption of the shock.",
      "rating": 1
    },
    {
      "id": 31,
      "description": "It’s a quality case, holds form around the phone very comfortably, it’s not super slick and doesn’t slide everywhere. It’s quite durable and has bounced off a few walls and not even a mark on the case! The ring around the cameras sticks out enough to protect them but does prevent your phone from being perfectly flat when laid on its back. Not a deal breaker for me but might be for some. Don’t regret a single penny spent for this case.",
      "rating": 5
    },
    {
      "id": 32,
      "description": "I recommend this case. I do tend to drop my phone a lot and so far the case has done a good protecting it. I also added in a glass protector shield for the front and camera.",
      "rating": 5
    },
    {
      "id": 33,
      "description": "I’ve dropped my phone a couple of times since I put this case one. Phone and case are still in tact. That’s why I love Otterbox. The only problem is sometimes it does charge wirelessly well (if you have a non-Apple wireless charger). You have to finagle it a bit since the camera juts out. Other than that, the case does what it’s supposed to (besides, there are other ways to charge the phone) which is why I didn’t knock it down a star.",
      "rating": 5
    },
    {
      "id": 34,
      "description": "I have been a fan of this brand for many years and this case does not disappoint. I was using an (overly expensive) Apple mag safe case. It started to deteriorate. Bits of the silicone covering started to fall off. And since the beginning, the buttons were difficult to press. Enter OtterBox. This is a nice clear sturdy plastic case. The buttons may be activated with normal pressure. And I do like the antimicrobial feature of this case. Most definitely worth the money.",
      "rating": 5
    },
    {
      "id": 35,
      "description": "I bought this for my husband and he really likes it. We both bought the Apple brand ones and they cracked easily and discolored quickly. but this one he’s had for a while and has had no issues. Plus it has a nice grip and feel to it.",
      "rating": 5
    },
    {
      "id": 36,
      "description": "Good product...and was the right fit...just a bit tricky to install because the top edge seals sometimes don't snap into place snug...some have that silicone fold at the very edge that you have to pick-out to even or watch out for as you set your phone in. The magnetic thing also works...fits my old Pop-socket thingy just fine as the original apple one does...for the price this one is a great replacement. Very Pleased with the purcchase.",
      "rating": 5
    },
    {
      "id": 37,
      "description": "This case is nice a durable. I have young kids and always on the move. My iPhone pro max has been pushed off tables, fallen out of vehicles, dropped on the floor, and who knows what else and I have yet to crack my screen or have issues with my phone. I’m tough on my phone and this has proven to hold up to the tests. 5 stars!!!!!!!",
      "rating": 5
    },
    {
      "id": 38,
      "description": "Looks just like the other ones but way better quality. The cheaper versions don’t hug the phone like this one. Good price for the quality",
      "rating": 5
    },
    {
      "id": 39,
      "description": "Looks nice on the phone. Looks resistant, strong. I feel my phone is protected. Easy to put on and take off. Magsafe battery works perfect. Side bottoms work perfect. Highly recommend it!!",
      "rating": 5
    },
    {
      "id": 40,
      "description": "I am so happy I went with the almost new option and got it use. There was no evidence of being used other than no manufacture packaging. I got it for less than half off. I will definitely do it again. Shipping was fast.A+! Thankyou",
      "rating": 5
    }
  ]